Autodesk.Revit.DB.Structure.RebarShapeSet
An set that contains rebar shapes.

Autodesk.Revit.DB.Structure.RebarShapeSet.Insert(Autodesk.Revit.DB.Structure.RebarShape)
System.Int32
Insert the specified rebar shape into the set.
item: The rebar shape to be inserted into the set.
Returns: Returns whether the rebar shape was inserted into the set.

Autodesk.Revit.DB.Structure.RebarShapeSet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.Structure.RebarShapeSet.ReverseIterator
Autodesk.Revit.DB.Structure.RebarShapeSetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.Structure.RebarShapeSet.ForwardIterator
Autodesk.Revit.DB.Structure.RebarShapeSetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.Structure.RebarShapeSet.Erase(Autodesk.Revit.DB.Structure.RebarShape)
System.Int32
Removes a specified rebar shape from the set.
item: The rebar shape to be erased.
Returns: The number of rebar shapes that were erased from the set.

Autodesk.Revit.DB.Structure.RebarShapeSet.Contains(Autodesk.Revit.DB.Structure.RebarShape)
System.Boolean
Tests for the existence of a rebar shape within the set.
item: The rebar shape to be searched for.
Returns: The Contains method returns True if the rebar shape is within the set, otherwise False.

Autodesk.Revit.DB.Structure.RebarShapeSet.Clear
void
Removes every rebar shape from the set, rendering it empty.

Autodesk.Revit.DB.Structure.RebarShapeSet.Size
System.Int32
get
Returns the number of rebar shapes that are in the set.

Autodesk.Revit.DB.Structure.RebarShapeSet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.